---
kind: enumMember
id: F:Autodesk.Revit.DB.Structure.FabricLocation.TopOrExternal
enum: Autodesk.Revit.DB.Structure.FabricLocation
source: html/965ab895-2f32-baaa-b065-d9cc4f359357.htm
---
# Autodesk.Revit.DB.Structure.FabricLocation.TopOrExternal

The fabric is on the top face of a floor host, or on the external face of a wall host.